# # От конзолата се четe 1 ред:
# # •	Наем за залата – цяло число
# # какъв бюджет ще бъде необходим
# # •	Торта  – цената ѝ е 20% от наема на залата
# # •	Напитки – цената им е 45% по-малко от тази на тортата
# # •	Аниматор – цената му е 1/3 от цената за наема на залата
# •	Торта  – цената ѝ е 20% от наема на залата
# •	Напитки – цената им е 45% по-малко от тази на тортата
# •	Аниматор – цената му е 1/3 от цената за наема на залата

rent = int(input())
cake_price = rent * 0.2
drinks_price = cake_price - (cake_price * 0.45)
animator = rent / 3
print(rent + cake_price + drinks_price + animator)